<details ><summary>plan for talos-bootstrap 2025-07-20 00:51:45 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project vaughnw128/immanent-grove#talos-bootstrap has been locked by PR #73
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.talos_vm["controlplane"] will be destroyed
  # (because key ["controlplane"] is not in for_each map)
  - resource "proxmox_virtual_environment_vm" "talos_vm" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "100" -> null
      - ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.50",
            ],
          - [],
          - [
              - "10.244.2.221",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> null
      - ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe7c:cce6",
            ],
          - [
              - "fe80::8cc6:b2ff:fe3d:9515",
            ],
          - [
              - "fe80::3057:8fff:fe26:a275",
            ],
          - [
              - "fe80::8eb:50ff:fec4:8115",
            ],
          - [
              - "fe80::b804:a6ff:feb5:4071",
            ],
          - [
              - "fe80::1ce5:dbff:fec5:b9b",
            ],
          - [
              - "fe80::3c49:86ff:fefb:163b",
            ],
          - [
              - "fe80::f8de:d9ff:fea6:80bc",
            ],
          - [
              - "fe80::60a5:9aff:fe9f:5356",
            ],
          - [
              - "fe80::c07a:16ff:fe6a:5ea1",
            ],
          - [
              - "fe80::8e2:d5ff:fe41:ba4e",
            ],
        ] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "C6:13:BB:8D:1E:39",
          - "9E:D4:BE:34:E2:AD",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:7C:CC:E6",
          - "8E:C6:B2:3D:95:15",
          - "32:57:8F:26:A2:75",
          - "0A:EB:50:C4:81:15",
          - "BA:04:A6:B5:40:71",
          - "1E:E5:DB:C5:0B:9B",
          - "3E:49:86:FB:16:3B",
          - "FA:DE:D9:A6:80:BC",
          - "62:A5:9A:9F:53:56",
          - "C2:7A:16:6A:5E:A1",
          - "0A:E2:D5:41:BA:4E",
        ] -> null
      - migrate                 = false -> null
      - name                    = "talos-controlplane" -> null
      - network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxcc87902087084",
          - "lxc862afe21551a",
          - "lxc7ff4a5c05d4d",
          - "lxc7b9d5530d79a",
          - "lxcd22c3853cd51",
          - "lxc962170b196b5",
        ] -> null
      - node_name               = "havnor" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = true -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "talos",
          - "terraform",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 100 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cpu {
          - cores        = 4 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v2-AES" -> null
          - units        = 1024 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - file_id           = "local:iso/talos-nocloud-amd64.img" -> null
          - interface         = "virtio0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-100-disk-0" -> null
          - replicate         = true -> null
          - size              = 100 -> null
          - ssd               = false -> null
            # (1 unchanged attribute hidden)
        }

      - initialization {
          - datastore_id         = "local-lvm" -> null
          - interface            = "ide2" -> null
            # (5 unchanged attributes hidden)

          - ip_config {
              - ipv4 {
                  - address = "10.0.0.50/24" -> null
                  - gateway = "10.0.0.1" -> null
                }
            }
        }

      - memory {
          - dedicated      = 16384 -> null
          - floating       = 0 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = false -> null
          - mac_address  = "BC:24:11:7C:CC:E6" -> null
          - model        = "virtio" -> null
          - mtu          = 0 -> null
          - queues       = 0 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-1"] will be created
  + resource "proxmox_virtual_environment_vm" "talos_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "talos-controlplane-1"
      + network_interface_names = (known after apply)
      + node_name               = "havnor"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "talos",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 4
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v2-AES"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + file_id           = "local:iso/talos-nocloud-amd64.img"
          + interface         = "virtio0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 100
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.0.0.50/24"
                  + gateway = "10.0.0.1"
                }
            }
        }

      + memory {
          + dedicated      = 16384
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # talos_machine_configuration_apply.config_apply["controlplane"] will be destroyed
  # (because key ["controlplane"] is not in for_each map)
  - resource "talos_machine_configuration_apply" "config_apply" {
      - apply_mode                  = "auto" -> null
      - client_configuration        = {
          - ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> null
          - client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
          - client_key         = (sensitive value) -> null
        } -> null
      - config_patches              = [
          - <<-EOT
                "cluster":
                  "allowSchedulingOnControlPlanes": true
                  "discovery":
                    "enabled": true
                  "network":
                    "cni":
                      "name": "none"
                  "proxy":
                    "disabled": true
            EOT,
        ] -> null
      - endpoint                    = "10.0.0.50" -> null
      - id                          = "machine_configuration_apply" -> null
      - machine_configuration       = (sensitive value) -> null
      - machine_configuration_input = (sensitive value) -> null
      - node                        = "10.0.0.50" -> null
    }

  # talos_machine_configuration_apply.config_apply["controlplane-1"] will be created
  + resource "talos_machine_configuration_apply" "config_apply" {
      + apply_mode                  = "auto"
      + client_configuration        = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + config_patches              = [
          + <<-EOT
                "cluster":
                  "allowSchedulingOnControlPlanes": true
                  "discovery":
                    "enabled": true
                  "network":
                    "cni":
                      "name": "none"
                  "proxy":
                    "disabled": true
            EOT,
        ]
      + endpoint                    = "10.0.0.50"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.0.50"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>